# Дан некоторый список чисел.

# Необходимо написать код, который последовательно выводит нечетные числа данного списка, а встретив
# число 666 - останавливает вывод.

# Если мы встречаем число 666 повторно - снова начинаем вывод, но уже четных чисел.

# И так далее.

nums = [849, 200, 809, 164, 926, 84, 892, 666, 880, 869, 775, 707, 874, 195, 120, 275, 328, 228, 43, 445, 421, 246, 666,
        324, 107, 455, 632, 666, 468, 603, 500, 666, 123, 435, 888, 666, 1, 1, 1, 1, 1, 2, 2, 2, 2, 666, 2, 2, 4, 3]

# odd X ... X even X ... X odd X ... X even X ...


toggle = 0

for n in nums:

    if toggle == 0:
        if n != 666 and n % 2 != 0:
            print(n)
            continue
        elif n == 666:
            toggle = 1
            continue

    if toggle == 1:
        if n != 666:
            continue
        elif n == 666:
            toggle = 2
            continue

    if toggle == 2:
        if n != 666 and n % 2 == 0:
            print(n)
            continue
        elif n == 666:
            toggle = 0
            continue
