"""
Homework description:

Дан некоторый список чисел.
Необходимо написать код, который последовательно выводит нечетные числа данного списка, а встретив
число 666 - останавливает вывод.
Если мы встречаем число 666 повторно - снова начинаем вывод, но уже четных чисел.
И так далее.
"""

nums = [849, 200, 809, 164, 926, 84, 892, # print odds: 849, 809
        666,
        880, 869, 775, 707, 874, 195, 120, 275, 328, 228, 43, 445, 421, 246, # not print
        666,
        324, 107, 455, 632, # print evens: 324, 632
        666,
        468, 603, 500, # not print
        666,
        123, 435, 888, # print odds: 123, 435
        666,
        1, 1, 1, 1, 1, 2, 2, 2, 2, # not print
        666,
        2, 2, 4, 3] # print evens: 2, 2, 4

"""
flag values:
1 - odd
2 - not print
3 - even
4 - not print
"""

flag = 1

for i in nums:
    match flag:
        case 1:
            if i != 666:
                if i % 2 != 0:
                    print(i)
            else:
                flag = 2
        case 2:
            if i == 666:
                flag = 3
        case 3:
            if i != 666:
                if i % 2 == 0:
                    print(i)
            else:
                flag = 4
        case 4:
            if i == 666:
                flag = 1
